backend/app/controllers/collections_controller.rb

    def index
        @collections = Collection.all
---
SELECT "collections".* FROM "collections"

    def create
        @collection = Collection.new(collection_params)
          if @collection.save
---
INSERT INTO "collections" ("name", "user", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "test"], ["user", "may"], ["created_at", "2021-05-19 00:18:41.283011"], ["updated_at", "2021-05-19 00:18:41.283011"]]

    def set_collection
        @collection = Collection.find(params[:id])
---
SELECT "collections".* FROM "collections" WHERE "collections"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]