backend/app/controllers/opera_collections_controller.rb

    def set_opera_collection
        @opera_collection = OperaCollection.find(params[:id])
---
SELECT "collections".* FROM "collections" WHERE "collections"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "opera_collections".* FROM "opera_collections" WHERE "opera_collections"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]