backend/app/controllers/opera_collections_controller.rb

SELECT "opera_collections".* FROM "opera_collections"
---
    def index
        @opera_collections = OperaCollection.all

SELECT "operas".* FROM "operas" WHERE "operas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_opera_collection
        @opera_collection = Opera.find(params[:id])