backend/app/controllers/operas_controller.rb

SELECT "operas".* FROM "operas"
---
    def index
        @operas = Opera.all

SELECT "operas".* FROM "operas" WHERE "operas"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def show
        @opera = Opera.find(params[:id])

INSERT INTO "operas" ("title", "director", "description", "img_src", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
    def create
        @opera = Opera.new(opera_params)

        if @opera.save

SELECT "operas".* FROM "operas" WHERE "operas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_opera
        @opera = Opera.find(params[:id])